In [2]:
import pandas as pd
import numpy as np

# Reading and Writing Data in Text Format

**read_csv('path'(main),
sep,
header,
index_col,
names,
skiprows,
na_values)**

In [3]:
df=pd.read_csv('H:/study/MCU.csv')

In [4]:
df.head(4)

               MCU    Budget  US and Canada     REVIEW
0         Iron man  14000000      319034126  SUPER HIT
1             Hulk  15000000      134806913        HIT
2             Thor  20000000      312433331  SUPER HIT
3  Captain America  15000000      181030624        HIT

In [5]:
 pd.read_csv('H:/study/MCU.csv', header=None)

                 0         1              2             3
0              MCU    Budget  US and Canada        REVIEW
1         Iron man  14000000      319034126     SUPER HIT
2             Hulk  15000000      134806913           HIT
3             Thor  20000000      312433331     SUPER HIT
4  Captain America  15000000      181030624           HIT
5         Avengers  22000000      623357910  BLOCKBLUSTER

In [6]:
pd.read_table('H:/study/MCU.csv')

            MCU,Budget,US and Canada,REVIEW
0     Iron man,14000000,319034126,SUPER HIT
1               Hulk,15000000,134806913,HIT
2         Thor,20000000,312433331,SUPER HIT
3    Captain America,15000000,181030624,HIT
4  Avengers,22000000,623357910,BLOCKBLUSTER

In [7]:
pd.read_csv('H:/study/MCU.csv', names=['a', 'b', 'c',  'message'])

                 a         b              c       message
0              MCU    Budget  US and Canada        REVIEW
1         Iron man  14000000      319034126     SUPER HIT
2             Hulk  15000000      134806913           HIT
3             Thor  20000000      312433331     SUPER HIT
4  Captain America  15000000      181030624           HIT
5         Avengers  22000000      623357910  BLOCKBLUSTER

In [8]:
names = ['a', 'b', 'c', 'message']

In [9]:
names

['a', 'b', 'c', 'message']

In [10]:
 pd.read_csv('H:/study/MCU.csv', names=names, index_col='message')

                            a         b              c
message
REVIEW                    MCU    Budget  US and Canada
SUPER HIT            Iron man  14000000      319034126
HIT                      Hulk  15000000      134806913
SUPER HIT                Thor  20000000      312433331
HIT           Captain America  15000000      181030624
BLOCKBLUSTER         Avengers  22000000      623357910

In [11]:
list(open('H:/study/MCU.csv'))

['ï»¿MCU,Budget,US and Canada,REVIEW\n',
 'Iron man,14000000,319034126,SUPER HIT\n',
 'Hulk,15000000,134806913,HIT\n',
 'Thor,20000000,312433331,SUPER HIT\n',
 'Captain America,15000000,181030624,HIT\n',
 'Avengers,22000000,623357910,BLOCKBLUSTER\n']

# Reading Text Files in Pieces

In [14]:
result = pd.read_csv('H:/study/MCU.csv')

In [15]:
result

               MCU    Budget  US and Canada        REVIEW
0         Iron man  14000000      319034126     SUPER HIT
1             Hulk  15000000      134806913           HIT
2             Thor  20000000      312433331     SUPER HIT
3  Captain America  15000000      181030624           HIT
4         Avengers  22000000      623357910  BLOCKBLUSTER

In [16]:
 pd.read_csv('H:/study/MCU.csv', nrows=3)

        MCU    Budget  US and Canada     REVIEW
0  Iron man  14000000      319034126  SUPER HIT
1      Hulk  15000000      134806913        HIT
2      Thor  20000000      312433331  SUPER HIT

In [28]:
import csv
lines = list(csv.reader(open('H:/study/MCU.csv')))

In [29]:
lines

[['', 'MCU', 'Budget', 'US and Canada', 'REVIEW'],
 ['0', 'Iron man', '14000000', '319034126', 'SUPER HIT'],
 ['1', 'Hulk', '15000000', '134806913', 'HIT'],
 ['2', 'Thor', '20000000', '312433331', 'SUPER HIT'],
 ['3', 'Captain America', '15000000', '181030624', 'HIT'],
 ['4', 'Avengers', '22000000', '623357910', 'BLOCKBLUSTER']]